[
  {
    "page_affected": "index",
    "lineset": [
      "BetterCensorship",
      "Censurar Imagen",
      "Quitar Censura de una Imagen",
      "Herramienta que permite la creación de imágenes censuradas con la información de la imagen original oculta dentro.",
      "Simplemente censura tu imagen con nuestra herramienta, agrega una contraseña y listo!.",
      "Para quitar la censura selecciona la imagen, agrega la contraseña y vualá! leyes de censura pasadas por alto con estilo!",
      "Todo esto se hace en el lado del cliente sin que nada se suba a un servidor. ¡Usa esta herramienta sin preocupaciones!",
      "Nota: Esta herramienta no hace magia. Solo a imágenes censuradas con esta herramienta se les puede quitar la censura.",
      "Inicio",
      "Censurar",
      "Quitar Censura",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  },
  {
    "page_affected": "censor",
    "lineset": [
      "Abrir Archivo",
      "(Para Censurar)",
      "Tamaño de la fuente (en px):",
      "Color del texto:",
      "Color del contorno:",
      "Fuente:",
      "Serif",
      "Sans-serif",
      "Monospace",
      "Cursive",
      "Fantasy",
      "Texto:",
      "¡Prueba a pasar el cursor sobre la imagen!",
      "Lente de Zoom",
      "¿Cómo uso esta herramienta?",
      "Pixelea presionando o manteniendo apretado el click izquierdo del mouse.",
      "Puedes cambiar el tamaño con Shift+Rueda del mouse o con el control deslizante/cuadro al lado",
      "Puedes deshacer y rehacer sus cambios presionando los botones de abajo (Ctrl+Z y Ctrl+Y también funcionan!)",
      "También puedes girar la \"herramienta\" de censura usando Ctrl+Rueda del mouse o con el control deslizante",
      "Puedes agregar una contraseña a sus datos ocultos para protegerlos de miradas indiscretas.",
      "Y luego simplemente presione descargar al final!",
      "Nota: Todos los cuadros de diálogo se pueden mover manteniendo presionado el título.",
      "Herramientas",
      "¡Agregar más imágenes!",
      "Girar la herramienta",
      "Agregar texto",
      "Tamaño de la herramienta",
      "Zoom:",
      "Apagado",
      "Encendido",
      "Agregar contraseña: ",
      "(Se puede dejar en blanco si deseas)",
      "Nombre del archivo:",
      "Deshacer",
      "Rehacer",
      "¡Descargar!",
      "Error",
      "Advertencia",
      "Cargando",
      "El controlador de imágenes falló. Vuelva a verificar que el archivo sea en realidad una imagen de no más de 4000x3000 y 50 MB de tamaño. Presione OK para recargar la página",
      "La imagen es demasiado grande (el límite seguro es de 4000x3200) El uso no garantizado. La herramienta puede ser inestable.",
      "La imagen ya contiene una carga útil de datos. Si continúa, se eliminarán dichos datos de la imagen censurada final.",
      "El archivo es demasiado grande para procesarlo correctamente (Maximo 50MB). Presione OK para recargar la página",
      "Espere mientras se procesa la imagen. El tiempo de procesamiento depende del tamaño y del contenido editado",
      "¡Entendido!",
      "OK",
      "Listo",
      "El archivo no es una imagen",
      "Algo salió mal. Por favor informe del error junto con cualquier archivo de imagen que estuviera usando.",
      "Inicio",
      "Censurar",
      "Quitar Censura",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  },
  {
    "page_affected": "decensor",
    "lineset": [
      "Abrir Archivo",
      "(Para quitar Censura)",
      "Contraseña: ",
      "(Dejar vacío si no usa)",
      "Quitar Censura!",
      "Error",
      "Cargando",
      "El archivo no es una imagen. Presione OK para recargar la página",
      "La imagen no fue creada con BetterCensorship. Presione OK para recargar la página",
      "Contraseña incorrecta. Presione OK para recargar la página",
      "Carga de datos corrupta. La imagen puede estar protegida por contraseña. Presione OK para recargar la página",
      "Espere mientras se procesa la imagen. El tiempo de procesamiento depende del tamaño y del contenido editado",
      "La versión no coincide",
      "OK",
      "Inicio",
      "Censurar",
      "Quitar Censura",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter",
      "¡Descargar!"
    ]
  },
  {
    "page_affected": "faq",
    "lineset": [
      "Preguntas Frecuentes",
      "¿Qué es esto?",
      "BetterCensorship es una nueva e innovadora herramienta que te permite censurar tus imágenes de forma sencilla y reversible para eludir las leyes de censura en varios estados draconianos.",
      "¿En serio? ¿Y cuánto cuesta esta \"herramienta\"?",
      "¡Nada! esta herramienta es completamente gratis. Ahora y en el futuro también.",
      "Entonces, ¿cómo generan ganancias? ¿Almacenan y venden los datos que subimos?",
      "No almacenamos ningún dato. Todo el codigo base es del lado del cliente, lo que significa que todo sucede en tu navegador y nada se sube a nuestros servidores. Este proyecto y cualquier otro que desarrollemos en Railgun Entertainment, han sido financiados por la buena gente de nuestro <a href=\"https://www.patreon.com/BetterRepack\">Patreon</a> y <a href=\"https://subscribestar.adult/betterrepack\">SubscribeStar</a>.",
      "¿Cómo sé que esta herramienta no desaparecerá repentinamente y mis imágenes quedarán permanentemente censuradas?",
      "Debido al hecho de que esta herramienta opera completamente dentro de tu navegador sin contacto con nuestro servidor, simplemente puedes guardar la página (Debe ser servida a través de un servidor web, puede ser uno local) o reconstruirla tu mismo <a href=\"https://github.com/Project-Railgun/BetterCensorship\">usando nuestro codigo</a> y seguirá funcionando.",
      "¿En qué servicios funcionan las imágenes generadas por esta herramienta?",
      "Cualquier servicio que almacene y muestre directamente las imágenes subidas por los usuarios sin ser modificadas serán compatibles con esta herramienta. Ejemplos de donde funciona correctamente son Pixiv, DeviantArt y Discord. Lugares en donde no funciona son Patreon y Twitter, que eliminan todos los datos de carga útil de dentro de las imágenes.",
      "No puedo hacer que las imágenes subidas a Pixiv funcionen correctamente.",
      "En Pixiv existe la limitación de que las imagenes solo deben tener un tipo de archivo. Solo debes subir PNGs y no JPEGs.",
      "La herramienta no parece funcionar en mi navegador.",
      "Ya que todas las operaciones ocurren del lado del cliente dentro de un script, herramientas que deshabilitan scripts (Noscript, bloqueo de scripts incorporado de navegador Brave, etc.) romperan esta herramienta.",
      "Inicio",
      "Censurar",
      "Quitar Censura",
      "FAQ",
      "Patreon",
      "SubscribeStar",
      "Twitter"
    ]
  }
]
